ConfigFiles/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Enums/ТипыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Catalogs/Организации/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	ДлиннаИННИП = 12;
	ДлиннаИННЮрЛицо = 10;
	
	// Проверяем, что ТипОрганизации заполнен
	Если НЕ ЗначениеЗаполнено(ТипОрганизации) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не указан тип организации!'"),,"Объект.ТипОрганизации",,Отказ);
		//Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЭтоИндивидуальныйПредприниматель = (ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель"));
	//Проверяем ИНН
	Если Не ПустаяСтрока(ИНН) Тогда
		Если ЭтоИндивидуальныйПредприниматель И СтрДлина(ИНН) <> ДлиннаИННИП Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Длина ИНН для ИП должна быть 12 символов!'"),,"Объект.ИНН",,Отказ);
			//Отказ = Истина;
		ИначеЕсли Не ЭтоИндивидуальныйПредприниматель И СтрДлина(ИНН) <> ДлиннаИННЮрЛицо Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Длина ИНН для юридического лица должна быть 10 символов!'"),,"Объект.ИНН",,Отказ);
			//Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
